{
  "Relacyjny model danych i algebra relacji: atrybuty, dziedziny atrybutów, krotki i relacje; operacje na relacjach": "Relacyjny model danych opisuje dane jako tabele (relacje) z atrybutami (kolumnami) i krotkami (wierszami). Algebra relacji to zestaw operacji do manipulacji tymi relacjami, takich jak selekcja, projekcja, złączenia itp.",
  "Język SQL – zapytania, selekcja, sortowanie, grupowanie, funkcje agregujące, podzapytania.": "SQL (Structured Query Language) to język do zarządzania relacyjnymi bazami danych. Pozwala na tworzenie zapytań, selekcję danych, sortowanie, grupowanie, korzystanie z funkcji agregujących i wykonywanie podzapytań.",
  "Instrukcje DML – usuwanie, aktualizacja i dołączanie danych.": "Instrukcje DML (Data Manipulation Language) w SQL obejmują operacje na danych, takie jak usuwanie (DELETE), aktualizacja (UPDATE) i dołączanie (INSERT) danych do tabel.",
  "Instrukcje DDL – tworzenie tabel, modyfikacje struktury tabel, usuwanie tabel.": "Instrukcje DDL (Data Definition Language) w SQL służą do definiowania struktury bazy danych. Obejmują tworzenie tabel, modyfikacje struktury tabel i usuwanie tabel.",
  "Zależności funkcyjne. Aksjomaty Armstronga. Integralność danych (klucze, klucze obce). Opcje propagacji.": "Zależności funkcyjne określają relacje między atrybutami w relacyjnych bazach danych. Aksjomaty Armstronga to reguły dotyczące manipulacji tymi zależnościami. Integralność danych obejmuje utrzymanie spójności danych, zwłaszcza poprzez klucze i klucze obce, a opcje propagacji określają działanie na danych w przypadku modyfikacji.",
  "Postacie normalne: 1NF, 2NF, 3NF, BCNF, 4NF. Normalizacja.": "Postacie normalne to reguły, które określają, w jaki sposób dane powinny być przechowywane w relacyjnej bazie danych, aby unikać redundancji i utrzymywać integralność. Normalizacja to proces dostosowywania schematu bazy danych do tych reguł.",
  "Indeksy. Widoki. Procedury składowane. Wyzwalacze.": "Indeksy to struktury danych, które przyspieszają procesy wyszukiwania w bazie danych. Widoki to zapytania, które są zapisane i można je odwoływać się do nich jak do tabeli. Procedury składowane to zbiorcze instrukcje SQL, które są przechowywane w bazie danych. Wyzwalacze to procedury, które są automatycznie uruchamiane w odpowiedzi na określone zdarzenia.",
  "Modelowanie danych: model logiczny (diagram związków encji - ERD) i model relacyjny": "Model logiczny, reprezentowany często za pomocą diagramu związków encji (ERD), opisuje strukturę danych bez związku z implementacją fizyczną. Model relacyjny to reprezentacja tych danych w formie tabel i relacji.",
  "Systemy transakcyjne i analityczne - podstawowe różnice": "Systemy transakcyjne obsługują krótkotrwałe operacje, takie jak wprowadzanie danych, natomiast systemy analityczne służą do analizy danych i podejmowania decyzji na podstawie danych historycznych.",
  "Transakcje. Własności ACID. Poziomy izolacji.": "Transakcje to sekwencje operacji, które są atomowe, spójne, izolowane i trwałe (własności ACID). Poziomy izolacji określają stopień oddzielenia transakcji od siebie nawzajem.",
  "Administrowanie użytkownikami bazy danych i ochrona danych.": "Administrowanie użytkownikami obejmuje zarządzanie dostępem do bazy danych, a ochrona danych to praktyki mające na celu zabezpieczenie danych przed nieautoryzowanym dostępem i modyfikacją."
}