{
  "Modele referencyjne systemu sieciowego, usługi, protokoły, interfejsy, standaryzacja": "Modele referencyjne, takie jak model OSI, służą do opisu funkcji warstwowych systemów sieciowych. Usługi to funkcje dostarczane przez sieć, protokoły to zbiory reguł komunikacji, a interfejsy definiują punkty połączenia. Standaryzacja to proces tworzenia wspólnych norm.",
  "Koncepcja kanału komunikacyjnego, media komunikacyjne, współdzielenie medium": "Kanał komunikacyjny to ścieżka, po której przesyłane są dane. Media komunikacyjne to fizyczne nośniki, takie jak kable lub fale radiowe. Współdzielenie medium to metoda dzielenia się dostępem do medium przez wiele urządzeń.",
  "Sieci komputerowe z komutacją pakietów, enkapsulacja danych, przełączanie, przełączniki": "Sieci z komutacją pakietów dzielą dane na pakiety, które są niezależnie przesyłane przez sieć. Enkapsulacja to opakowywanie danych w nagłówki i stopki. Przełączanie polega na przekierowywaniu pakietów przez przełączniki.",
  "Sieci komputerowe z komutacją obwodów, obwody wirtualne, tunelowanie": "Sieci z komutacją obwodów tworzą stałe połączenia między nadawcą a odbiorcą. Obwody wirtualne to logiczne połączenia w ramach fizycznego obwodu. Tunelowanie to przesyłanie jednego protokołu przez inne.",
  "Trasowanie, sterowanie ruchem, obciążeniem, przepływnością, jakością usług": "Trasowanie to proces wybierania najlepszej ścieżki dla danych. Sterowanie ruchem, obciążeniem i przepływnością dotyczy zarządzania przepływem danych w sieci. Jakość usług to zapewnienie określonych parametrów usług, np. opóźnienia czy przepustowości.",
  "Typowe protokoły sieciowe i transportowe": "Protokoły sieciowe, takie jak TCP/IP, definiują reguły komunikacji w sieci. Protokoły transportowe, jak TCP (Transmission Control Protocol) i UDP (User Datagram Protocol), zarządzają przesyłaniem danych między aplikacjami.",
  "Typowe usługi sieciowe, związane z nimi protokoły i aplikacje": "Usługi sieciowe, takie jak WWW (World Wide Web) lub FTP (File Transfer Protocol), mają swoje protokoły komunikacyjne, np. HTTP dla WWW czy FTP dla transferu plików. Aplikacje, takie jak przeglądarki internetowe czy klienty FTP, korzystają z tych usług.",
  "Zagrożenia bezpieczeństwa w środowiskach sieciowych, ochrona i przeciwdziałanie": "Zagrożenia obejmują ataki, takie jak ataki typu DoS (Denial of Service) czy ataki hakerskie. Ochrona to zastosowanie środków bezpieczeństwa, takich jak firewalle, szyfrowanie czy systemy detekcji intruzów, aby przeciwdziałać zagrożeniom."
}