{
  "Koncepcja systemu operacyjnego, typowa funkcjonalność, realizacje": "System operacyjny to program zarządzający zasobami komputera. Typowa funkcjonalność obejmuje zarządzanie procesami, pamięcią, urządzeniami wejścia/wyjścia i plikami. Realizacje to różne systemy operacyjne, takie jak Windows, Linux, czy macOS.",
  "Zarządzanie zasobami, abstrakcje systemowe": "Zarządzanie zasobami to kontrola dostępu do zasobów komputera, takich jak CPU, pamięć, czy urządzenia. Abstrakcje systemowe to interfejsy, które ukrywają szczegóły implementacyjne, ułatwiając programistom korzystanie z zasobów.",
  "Procesy i wątki, wielozadaniowość/wielowątkowość, wielodostęp": "Procesy i wątki to jednostki wykonawcze w systemie operacyjnym. Wielozadaniowość polega na równoczesnym wykonywaniu wielu procesów, a wielowątkowość na równoczesnym wykonywaniu wielu wątków w obrębie jednego procesu. Wielodostęp to jednoczesny dostęp wielu użytkowników do systemu.",
  "Mechanizmy komunikacji wewnątrzsystemowej": "Mechanizmy komunikacji wewnątrzsystemowej umożliwiają komunikację między procesami lub wątkami w ramach systemu operacyjnego. Mogą obejmować kolejki, semafory, czy komunikację międzyprocesową.",
  "Zarządzanie zbiorami danych, pliki, systemy plików": "Zarządzanie zbiorami danych to kontrola dostępu do danych przechowywanych w systemie. Pliki to struktury organizujące dane, a systemy plików to narzędzia zarządzające strukturą i dostępem do plików.",
  "Interfejsy systemowe dla wykonywanego kodu, dla programisty, dla użytkownika": "Interfejsy systemowe dla kodu to API, umożliwiające programom korzystanie z funkcji systemu. Dla programisty obejmuje narzędzia do programowania, a dla użytkownika interfejs graficzny lub wiersz poleceń.",
  "Wirtualizacja sprzętu i zasobów systemowych": "Wirtualizacja umożliwia uruchamianie wielu systemów operacyjnych na jednym fizycznym komputerze. Wirtualizacja sprzętu polega na udostępnianiu wirtualnych maszyn, a wirtualizacja zasobów na dzieleniu i zarządzaniu zasobami.",
  "Współczesne koncepcje budowy systemów operacyjnych": "Współczesne systemy operacyjne często stosują mikrojądro, modułowość, a także integrują technologie wirtualizacji, bezpieczeństwa i zarządzania energią. Przykłady to Linux, Windows 10, czy macOS."
}